Geordat/seal_stm32/nfc_seal/nfc_tag/ili9341_cube.c
#include "ili9341_cube.h"
#include "stm32f7xx_hal.h"
#include "main.h"
#include "st25dv.h"
#define   hbus_i2c2 hi2c1
#include "stdio.h"
extern I2C_HandleTypeDef hi2c1;

void MX_I2C2_Init2(void)
 {

   /* USER CODE BEGIN I2C2_Init 0 */

   /* USER CODE END I2C2_Init 0 */

   /* USER CODE BEGIN I2C2_Init 1 */

   /* USER CODE END I2C2_Init 1
   hi2c2.Instance = I2C1;
   hi2c2.Init.ClockSpeed = 400000;
   hi2c2.Init.DutyCycle = I2C_DUTYCYCLE_2;
   hi2c2.Init.OwnAddress1 = 0;
   hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
   hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
   hi2c2.Init.OwnAddress2 = 0;
   hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
   hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
   if (HAL_I2C_Init(&hi2c2) != HAL_OK)
   {
     Error_Handler();
   } */
   /* USER CODE BEGIN I2C2_Init 2 */

   /* USER CODE END I2C2_Init 2 */

 }

 int32_t BSP_I2C2_DeInit(void)
 {
   int32_t ret = BSP_ERROR_NONE;
/*
   if (I2C2InitCounter > 0)
   {
     I2C2InitCounter = 0;
   #if (USE_HAL_I2C_REGISTER_CALLBACKS == 0)

     I2C2_MspDeInit(&hbus_i2c2);
   #endif
      DeInit the I2C
     if (HAL_I2C_DeInit(&hbus_i2c2) != HAL_OK)
     {
       ret = BSP_ERROR_BUS_FAILURE;
     }
   }*/
   return ret;
 }

 int32_t BSP_I2C2_IsReady(uint16_t DevAddr, uint32_t Trials)
 {
   int32_t ret = BSP_ERROR_NONE;

   if (HAL_I2C_IsDeviceReady(&hbus_i2c2, DevAddr, Trials, BUS_I2C2_POLL_TIMEOUT) != HAL_OK)
   {
     ret = BSP_ERROR_BUSY;
   }

   return ret;
 }

 int32_t BSP_I2C2_WriteReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
 {
   int32_t ret = BSP_ERROR_NONE;

   if (HAL_I2C_Mem_Write(&hbus_i2c2, DevAddr, Reg, I2C_MEMADD_SIZE_16BIT,
                               pData, Length, BUS_I2C2_POLL_TIMEOUT) != HAL_OK)
   {
     if (HAL_I2C_GetError(&hbus_i2c2) == HAL_I2C_ERROR_AF)
     {
       ret = BSP_ERROR_BUS_ACKNOWLEDGE_FAILURE;
     }
     else
     {
       ret = BSP_ERROR_PERIPH_FAILURE;
     }
   }
   return ret;
 }

 int32_t BSP_I2C2_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
 {
   int32_t ret = BSP_ERROR_NONE;

   if (HAL_I2C_Mem_Read(&hbus_i2c2, DevAddr, Reg, I2C_MEMADD_SIZE_16BIT, pData, Length, BUS_I2C2_POLL_TIMEOUT) != HAL_OK)
   {
     if (HAL_I2C_GetError(&hbus_i2c2) != HAL_I2C_ERROR_AF)
     {
       ret = BSP_ERROR_BUS_ACKNOWLEDGE_FAILURE;
     }
     else
     {
       ret = BSP_ERROR_PERIPH_FAILURE;
     }
   }
   return ret;
 }

 int32_t BSP_GetTick(void)
 {
   return (int32_t)HAL_GetTick();
 }


 #ifndef NULL
 #define NULL      (void *) 0
 #endif

 /* Private macros ------------------------------------------------------------*/
 /* Private variables ---------------------------------------------------------*/
 /* Global variables ----------------------------------------------------------*/
 static NFCTAG_DrvTypeDef *Nfctag_Drv = NULL;
 /* static uint8_t NfctagInitialized = 0; */
 static ST25DV_Object_t NfcTagObj;

 /* Private function prototypes -----------------------------------------------*/
 /* Functions Definition ------------------------------------------------------*/
 /**
   * @brief  Initializes peripherals used by the I2C NFCTAG driver.
   * @return NFCTAG_StatusTypeDef enum status.
   */
 int32_t BSP_NFCTAG_Init(uint32_t Instance)
 {
   int32_t status;
   ST25DV_IO_t IO;
   UNUSED(Instance);

   /* Configure the component */
   IO.Init         =(ST25DV_Init_Func)MX_I2C2_Init2;
   IO.DeInit       = BSP_I2C2_DeInit;
   IO.IsReady      = BSP_I2C2_IsReady;
   IO.Read         = BSP_I2C2_ReadReg16;
   IO.Write        = (ST25DV_Write_Func)BSP_I2C2_WriteReg16;
   IO.GetTick      = BSP_GetTick;

   status = ST25DV_RegisterBusIO (&NfcTagObj, &IO);
   if (status != NFCTAG_OK)
     return NFCTAG_ERROR;

   Nfctag_Drv = (NFCTAG_DrvTypeDef *)(void *)&St25Dv_Drv;
   if (Nfctag_Drv->Init != NULL)
   {
     status = Nfctag_Drv->Init(&NfcTagObj);
     if (status != NFCTAG_OK)
     {
       Nfctag_Drv = NULL;
       return NFCTAG_ERROR;
     }
   }
   else
   {
     Nfctag_Drv = NULL;
     return NFCTAG_ERROR;
   }
   return NFCTAG_OK;
 }

 /**
   * @brief  Deinitializes peripherals used by the I2C NFCTAG driver
   * @param  None
   * @retval None
   */
 void BSP_NFCTAG_DeInit(uint32_t Instance)
 {
   UNUSED(Instance);

   if (Nfctag_Drv != NULL)
   {
     Nfctag_Drv = NULL;
     NfcTagObj.IsInitialized = 0;
   }
 }

 /**
   * @brief  Checks if the nfctag is initialized.
   * @retval 0 if the nfctag is not initialized, 1 if the nfctag is already initialized
   */
 uint8_t BSP_NFCTAG_isInitialized(uint32_t Instance)
 {
   int32_t status;
   UNUSED(Instance);
    status = NfcTagObj.IsInitialized;
    return status;
 }

 /**
   * @brief  Reads the ID of the nfctag.
   * @param  wai_id Pointer where the who_am_i of the device is stored.
   * @return NFCTAG_StatusTypeDef enum status.
   */
 int32_t BSP_NFCTAG_ReadID(uint32_t Instance, uint8_t * const wai_id)
 {
   UNUSED(Instance);
   if (Nfctag_Drv->ReadID == NULL)
   {
     return NFCTAG_ERROR;
   }

   return Nfctag_Drv->ReadID(&NfcTagObj, wai_id);
 }

 /**
   * @brief  Checks if the nfctag is available.
   * @param  Trials Number of trials.
   * @return NFCTAG_StatusTypeDef enum status.
   */
 int32_t BSP_NFCTAG_IsDeviceReady(uint32_t Instance, const uint32_t Trials)
 {
   UNUSED(Instance);
   if (Nfctag_Drv->IsReady == NULL)
   {
     return NFCTAG_ERROR;
   }

   return Nfctag_Drv->IsReady(&NfcTagObj, Trials);
 }

 /**
   * @brief  Configures the nfctag interrupt.
   * @param  ITConfig Defines the interrupt mask to be configured.
   * @details  - 0x01 => RF BUSY
   *           - 0x02 => WIP
   *           - 0x04 => RF_INTERRUPT
   *           - 0x08 => FIELD_CHANGE
   *           - 0x10 => RF_PUT_MSG
   *           - 0x20 => RF_GET_MSG
   *           - 0x40 => RF_WRITE
   * @return NFCTAG_StatusTypeDef enum status.
   */
 int32_t BSP_NFCTAG_ConfigIT(uint32_t Instance, const uint16_t ITConfig)
 {
   UNUSED(Instance);
   if (Nfctag_Drv->ConfigIT == NULL)
   {
     return NFCTAG_ERROR;
   }
   return Nfctag_Drv->ConfigIT(&NfcTagObj, ITConfig);
 }

 /**
   * @brief  Reads the nfctag interrupt configutration.
   * @param  ITConfig Pointer on uint16_t used to return the interrupt configuration.
   * @details  - 0x01 => RF BUSY
   *           - 0x02 => WIP
   *           - 0x04 => RF_INTERRUPT
   *           - 0x08 => FIELD_CHANGE
   *           - 0x10 => RF_PUT_MSG
   *           - 0x20 => RF_GET_MSG
   *           - 0x40 => RF_WRITE
   * @return NFCTAG_StatusTypeDef enum status.
   */
 int32_t BSP_NFCTAG_GetITStatus(uint32_t Instance, uint16_t * const ITConfig)
 {
   UNUSED(Instance);
   if (Nfctag_Drv->GetITStatus == NULL)
   {
     return NFCTAG_ERROR;
   }

   return Nfctag_Drv->GetITStatus(&NfcTagObj, ITConfig);
 }

 /**
   * @brief  Reads the data in the nfctag at specified address.
   * @param  pData   Pointer on the buffer used to store read data.
   * @param  TarAddr I2C data memory address to be read.
   * @param  Size    Number of bytes to be read.
   * @return NFCTAG_StatusTypeDef enum status.
   */
 int32_t BSP_NFCTAG_ReadData(uint32_t Instance, uint8_t * const pData, const uint16_t TarAddr, const uint16_t Size)
 {
   UNUSED(Instance);
   if (Nfctag_Drv->ReadData == NULL)
   {
     return NFCTAG_ERROR;
   }

