Geordat/seal_stm32/nfc_seal/nfc_tag/ili9341_cube.c
 /**
   * @brief  Dynamically sets the Energy Harvesting mode.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_SetEHENMode_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_SetEHENMode_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Dynamically unsets the Energy Harvesting mode.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_ResetEHENMode_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_ResetEHENMode_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Reads the EH_ON status from the EH_CTRL_DYN register.
   * @param  pEHON Pointer on a ST25DV_EN_STATUS value used to return the EHON status.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_GetEHON_Dyn(uint32_t Instance, ST25DV_EN_STATUS * const pEHON)
 {
   UNUSED(Instance);
   return ST25DV_GetEHON_Dyn(&NfcTagObj, pEHON);
 }

 /**
   * @brief  Checks if RF Field is present in front of the ST25DV.
   * @param  pRF_Field Pointer on a ST25DV_FIELD_STATUS value used to return the field presence.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_GetRFField_Dyn(uint32_t Instance, ST25DV_FIELD_STATUS * const pRF_Field)
 {
   UNUSED(Instance);
   return ST25DV_GetRFField_Dyn(&NfcTagObj, pRF_Field);
 }

 /**
   * @brief  Check if VCC is supplying the ST25DV.
   * @param  pVCC ST25DV_VCC_STATUS pointer of the VCC status to store
   * @retval NFCTAG enum status.
   */
 int32_t BSP_NFCTAG_GetVCC_Dyn(uint32_t Instance, ST25DV_VCC_STATUS * const pVCC)
 {
   UNUSED(Instance);
   return ST25DV_GetVCC_Dyn(&NfcTagObj, pVCC);
 }

 /**
   * @brief  Read value of dynamic RF Management configuration
   * @param  pRF_Mngt : ST25DV_RF_MNGT pointer of the dynamic RF Management configuration to store
   * @retval NFCTAG enum status
   */
 int32_t BSP_NFCTAG_ReadRFMngt_Dyn(uint32_t Instance, ST25DV_RF_MNGT * const pRF_Mngt)
 {
   UNUSED(Instance);
   return ST25DV_ReadRFMngt_Dyn(&NfcTagObj, pRF_Mngt);
 }

 /**
   * @brief  Writes a value to the RF Management dynamic register.
   * @param  RF_Mngt Value to be written to the RF Management dynamic register.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_WriteRFMngt_Dyn(uint32_t Instance, const uint8_t RF_Mngt)
 {
   UNUSED(Instance);
   return ST25DV_WriteRFMngt_Dyn(&NfcTagObj, RF_Mngt);
 }

 /**
   * @brief  Reads the RFDisable dynamic register information.
   * @param  pRFDisable Pointer on a ST25DV_EN_STATUS value used to return the RF Disable state.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_GetRFDisable_Dyn(uint32_t Instance, ST25DV_EN_STATUS * const pRFDisable)
 {
   UNUSED(Instance);
   return ST25DV_GetRFDisable_Dyn(&NfcTagObj, pRFDisable);
 }

 /**
   * @brief  Sets the RF Disable dynamic configuration.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_SetRFDisable_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_SetRFDisable_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Unsets the RF Disable dynamic configuration.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_ResetRFDisable_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_ResetRFDisable_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Reads the RFSleep dynamic register information.
   * @param  pRFSleep Pointer on a ST25DV_EN_STATUS values used to return the RF Sleep state.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_GetRFSleep_Dyn(uint32_t Instance, ST25DV_EN_STATUS * const pRFSleep)
 {
   UNUSED(Instance);
   return ST25DV_GetRFSleep_Dyn(&NfcTagObj, pRFSleep);
 }

 /**
   * @brief  Sets the RF Sleep dynamic configuration.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_SetRFSleep_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_SetRFSleep_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Unsets the RF Sleep dynamic configuration.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_ResetRFSleep_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_ResetRFSleep_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Reads the Mailbox ctrl dynamic register.
   * @param  pCtrlStatus Pointer on a ST25DV_MB_CTRL_DYN_STATUS structure used
   *         to return the dynamic Mailbox ctrl information.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_ReadMBCtrl_Dyn(uint32_t Instance, ST25DV_MB_CTRL_DYN_STATUS * const pCtrlStatus)
 {
   UNUSED(Instance);
   return ST25DV_ReadMBCtrl_Dyn(&NfcTagObj, pCtrlStatus);
 }

 /**
   * @brief  Reads the Mailbox Enable dynamic configuration.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_GetMBEN_Dyn(uint32_t Instance, ST25DV_EN_STATUS * const pMBEN)
 {
   UNUSED(Instance);
   return ST25DV_GetMBEN_Dyn(&NfcTagObj, pMBEN);
 }

 /**
   * @brief  Sets the Mailbox Enable dynamic configuration.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_SetMBEN_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_SetMBEN_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Unsets the Mailbox Enable dynamic configuration.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_ResetMBEN_Dyn(uint32_t Instance)
 {
   UNUSED(Instance);
   return ST25DV_ResetMBEN_Dyn(&NfcTagObj);
 }

 /**
   * @brief  Reads the Mailbox message length dynamic register.
   * @param  pMBLength Pointer on a uint8_t used to return the Mailbox message length.
   * @return int32_t enum status.
   */
 int32_t BSP_NFCTAG_ReadMBLength_Dyn(uint32_t Instance, uint8_t * const pMBLength)
 {
   UNUSED(Instance);
   return ST25DV_ReadMBLength_Dyn(&NfcTagObj, pMBLength);
 }





